# 184. Department Highest Salary

The Employee table holds all employees. Every employee has an Id, a salary, and there is also a column for the department Id.

+----+-------+--------+--------------+
| Id | Name  | Salary | DepartmentId |
+----+-------+--------+--------------+
| 1  | Joe   | 70000  | 1            |
| 2  | Henry | 80000  | 2            |
| 3  | Sam   | 60000  | 2            |
| 4  | Max   | 90000  | 1            |
+----+-------+--------+--------------+
The Department table holds all departments of the company.

+----+----------+
| Id | Name     |
+----+----------+
| 1  | IT       |
| 2  | Sales    |
+----+----------+
Write a SQL query to find employees who have the highest salary in each of the departments. 
For the above tables, Max has the highest salary in the IT department and Henry has the highest salary in the Sales department.

+------------+----------+--------+
| Department | Employee | Salary |
+------------+----------+--------+
| IT         | Max      | 90000  |
| Sales      | Henry    | 80000  |
+------------+----------+--------+

In [1]:
import pandas as pd
Employee= pd.DataFrame({'Id':[1,2,3,4],'Name':['Joe','Henry','Sam','Max'],'Salary':[70000,80000,60000,90000],'DepartmentId':[1,2,2,1]})
Employee= Employee[['Id','Name','Salary','DepartmentId']]
Employee

   Id   Name  Salary  DepartmentId
0   1    Joe   70000             1
1   2  Henry   80000             2
2   3    Sam   60000             2
3   4    Max   90000             1

In [2]:
Department= pd.DataFrame({'Id':[1,2],'Name':['IT','Sales']})
Department= Department[['Id','Name']]
Department

   Id   Name
0   1     IT
1   2  Sales

In [3]:
pme=pd.merge(Department,Employee,how='left', left_on='Id', right_on='DepartmentId')
pme

   Id_x Name_x  Id_y Name_y  Salary  DepartmentId
0     1     IT     1    Joe   70000             1
1     1     IT     4    Max   90000             1
2     2  Sales     2  Henry   80000             2
3     2  Sales     3    Sam   60000             2

In [4]:
pme['Name_x']

0       IT
1       IT
2    Sales
3    Sales
Name: Name_x, dtype: object

In [5]:
pme.reset_index().groupby(['Name_x'])['Salary'].idxmax()

Name_x
IT       1
Sales    2
Name: Salary, dtype: int64

In [6]:
outp=pme.loc[pme.reset_index().groupby(['Name_x'])['Salary'].idxmax()]
outp

   Id_x Name_x  Id_y Name_y  Salary  DepartmentId
1     1     IT     4    Max   90000             1
2     2  Sales     2  Henry   80000             2

In [7]:
output=outp[['Name_x','Name_y','Salary']]
output

  Name_x Name_y  Salary
1     IT    Max   90000
2  Sales  Henry   80000

In [8]:
output.columns=['Department','Employee','Salary']
output

  Department Employee  Salary
1         IT      Max   90000
2      Sales    Henry   80000

In [9]:
print(output.to_string(index=False))

Department Employee  Salary
       IT      Max   90000
    Sales    Henry   80000